[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationTable.js:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "Organization Code",
-      accessor: "orgCode", // accessor is the "key" in the data
-    },
-
-    {
-      Header: "Organization Translation Short",
-      accessor: "orgTranslationShort",
-    },
-    {
-      Header: "Organization Translation",
-      accessor: "orgTranslation",
-    },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      Cell: ({ value }) => (value ? "True" : "False"),
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:37:5
   };
 
   const columns = [
-    {
-      Header: "Organization Code",
-      accessor: "orgCode", // accessor is the "key" in the data
-    },
+    {},
 
     {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:39:17
   const columns = [
     {
       Header: "Organization Code",
-      accessor: "orgCode", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
 
killedBy: UCSBOrganizationIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:43:15
     },
 
     {
-      Header: "Organization Translation Short",
+      Header: "",
       accessor: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Translation Short. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      r

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:46:5
       Header: "Organization Translation Short",
       accessor: "orgTranslationShort",
     },
-    {
-      Header: "Organization Translation",
-      accessor: "orgTranslation",
-    },
+    {},
     {
       Header: "Inactive",
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationTable.js:53:13
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "True" : "False"),
+      Cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  False
Received:
