[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:93:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "tableOrBreakoutRoom is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:117:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "requestTime is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /requestTime is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:117:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "requestTime is required"}
+              {errors.requestTime || "requestTime is required"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
