[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:74:54
   }
 
   return (
-    <OurTable data={dates} columns={columns} testid={"HelpRequestTable"} />
+    <OurTable data={dates} columns={columns} testid={""} />
   );
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
