[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewsForm.js:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewsForm.js:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="MenuItemReviewsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
       </Row>
 
killedBy: MenuItemReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsForm.js:75:27
               type="email"
               isInvalid={Boolean(errors.reviewEmail)}
               {...register("reviewEmail", {
-                required: "Reviewer Email is required.",
+                required: "",
               })}
             />
killedBy: MenuItemReviewsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewsForm.js:79:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewEmail?.message}
+              {errors.reviewEmail.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewsForm.js:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "Date Reviewed is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewsForm.js:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "Date Reviewed is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
