[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewsTable.js:15:34
 export default function MenuItemReviewsTable({ review, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/menuitemreviews/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreviews/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:40:17
     },
     {
       Header: "itemId",
-      accessor: "itemId",
+      accessor: "",
     },
     {
killedBy: UserTable tests renders table with correct column accessors and data
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4
Received:

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:42:5
       Header: "itemId",
       accessor: "itemId",
     },
-    {
-      Header: "reviewEmail",
-      accessor: "reviewEmail",
-    },
+    {},
     {
       Header: "stars",
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:46:5
       Header: "reviewEmail",
       accessor: "reviewEmail",
     },
-    {
-      Header: "stars",
-      accessor: "stars",
-    },
+    {},
     {
       Header: "dateReviewed",
killedBy: MenuItemReviewsIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:51:15
       accessor: "stars",
     },
     {
-      Header: "dateReviewed",
+      Header: "",
       accessor: "dateReviewed",
     },
killedBy: UserTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: dateReviewed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:52:17
     },
     {
       Header: "dateReviewed",
-      accessor: "dateReviewed",
+      accessor: "",
     },
     {
killedBy: UserTable tests renders table with correct column accessors and data
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2024-11-03T12:00:00
Received:

[Killed] BlockStatement
main/components/MenuItemReviews/MenuItemReviewsTable.js:60:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:62:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:65:20
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"),
+      ButtonColumn("", "danger", deleteCallback, "MenuItemReviewsTable"),
     );
   }
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.js:65:56
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
