[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReviews) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReviews.itemId,
-      reviewEmail: menuItemReviews.reviewEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReviews) => {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:8:53
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReviews) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReviews.itemId,
-      reviewEmail: menuItemReviews.reviewEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments,
-    },
-  });
+  const objectToAxiosParams = (menuItemReviews) => ({});
 
   const onSuccess = (menuItemReviews) => {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:9:10
 
 export default function MenuItemReviewsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (menuItemReviews) => ({
-    url: "/api/menuitemreview/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 1 itemId: 4"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:20:42
     },
   });
 
-  const onSuccess = (menuItemReviews) => {
-    toast(`New menuItemReviews Created - id: ${menuItemReviews.id} itemId: ${menuItemReviews.itemId}`);
-  };
+  const onSuccess = (menuItemReviews) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 1 itemId: 4"

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:21:11
   });
 
   const onSuccess = (menuItemReviews) => {
-    toast(`New menuItemReviews Created - id: ${menuItemReviews.id} itemId: ${menuItemReviews.itemId}`);
+    toast(``);
   };
 
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 1 itemId: 4"
Received: ""

Number of calls: 1
