[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:21:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/menuitemreview`,
+      url: ``,
       params: {
         id,
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewEmail: menuItemReview.reviewEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReviews Updated - id: 17 itemId: 22"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:43:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `MenuItemReviews Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:45:7
 
   const onSuccess = (menuItemReview) => {
     toast(
-      `MenuItemReviews Updated - id: ${menuItemReview.id} itemId: ${menuItemReview.itemId}`,
+      ``,
     );
   };
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "MenuItemReviews Updated - id: 17 itemId: 22"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReviews</h1>
-        {menuItemReview && (
-          <MenuItemReviewsForm
-            initialContents={menuItemReview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReviews</h1>
-        {menuItemReview && (
-          <MenuItemReviewsForm
-            initialContents={menuItemReview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
