[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.js:20:42
     },
   });
 
-  const onSuccess = (menuItemReviews) => {
-    toast(
-      `New menuItemReviews Created - id: ${menuItemReviews.id} itemId: ${menuItemReviews.itemId}`,
-    );
-  };
+  const onSuccess = (menuItemReviews) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReviews Created - id: 1 itemId: 4"

Number of calls: 0
