[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/RecommendationRequest/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/RecommendationRequest/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:63:17
     },
     {
       Header: "Done",
-      accessor: (recommendationRequest) =>
-        recommendationRequest.done.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
