[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:22:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="UCSBDiningCommonsMenuItemForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid="UCSBDiningCommonsMenuItemForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: UCSBDiningCommonsMenuItemForm tests Renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:22:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="UCSBDiningCommonsMenuItemForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBDiningCommonsMenuItemForm tests Renders correctly when passing in a ucsbDiningCommonsMenuItem
statusReason: Error: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItemForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:61:24
           isInvalid={Boolean(errors.name)}
           {...register("name", {
             required: "Name is required",
-            maxLength: {
-              value: 30,
-              message: "Name must be 30 characters or less",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function
